docs/blog/20201210.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>First Year of Carbs Linux</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cem Keylan">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">First Year of Carbs Linux</h1>
<p class="subtitle">posted on 2020-12-10</p>
</header><p>
December 10, 2020 marks the first year after the initial release of Carbs Linux.
When I forked the KISS Linux repository on the 9th of December, I was fairly new
to package management. Carbs Linux used to be almost identical to KISS Linux. A
lot has changed since then:
</p>

<ul class="org-ul">
<li>[2020 Jan 13] Replaced default init system to <code>sinit</code></li>
<li>[2020 Jan 15] Packaged <code>WebKit2GTK</code></li>
<li>[2020 May 17] Added <code>bearssl</code> on the testing repository</li>
<li>[2020 May 28] Added <code>rsync</code> repository support to kiss</li>
<li>[2020 Jun 03] Replaced <code>bison</code> with <code>byacc</code></li>
<li>[2020 Jun 11] Replaced <code>libressl</code> with <code>bearssl</code></li>
<li>[2020 Jun 24] Replaced <code>kiss</code> with <code>cpt</code></li>
</ul>

<p>
I have really enjoyed maintaining and developing this distribution, and I want
to thank everyone who was involved in some way or another. While I have slowed
down in development due to college workload, I am still actively maintaining all
the packages on the repository. I do have some ideas that I am thinking of
implementing during the semester break. Hope to see you all in January.
</p>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
